app/controllers/todos_controller.rb

  def index
    @todos = Todo.all
---
SELECT `todos`.* FROM `todos`

  def show
    @todo = Todo.find(params[:id])
---
SELECT `todos`.* FROM `todos` WHERE `todos`.`id` = 1 LIMIT 1

  def create
    @todo = Todo.new(params[:todo])

    respond_to do |format|
      if @todo.save
---
INSERT INTO `todos` (`created_at`, `title`, `updated_at`) VALUES ('2012-04-22 21:27:41', 'My todo', '2012-04-22 21:27:41')

  def update
    @todo = Todo.find(params[:id])

    respond_to do |format|
      if @todo.update_attributes(params[:todo])
---
SELECT `todos`.* FROM `todos` WHERE `todos`.`id` = 1 LIMIT 1
UPDATE `todos` SET `updated_at` = '2012-04-23 13:32:51', `title` = 'My todo 2' WHERE `todos`.`id` = 1

  def destroy
    @todo = Todo.find(params[:id])
    @todo.destroy
---
SELECT `todos`.* FROM `todos` WHERE `todos`.`id` = 2 LIMIT 1
DELETE FROM `todos` WHERE `todos`.`id` = 2